package Lesson_1;/*
1. Написать программу осуществляющую решение линейного уравнения ax + b = 0.
a и b задаете в программе, х выводите на экран.
*/

public class Task_1 {
    public static void main(String[] args) {
//   double a = 756.0, b = 34.0;
//   double x = -b / a;
    int a = 2, b = 10;
    int x = -b / a;
        System.out.println("ax + b = 0");
        System.out.print("x = " + x);
    }
}

