/*
2. Создать программу, выводящую на экран ближайшее к 10 из двух чисел, записанных в переменные m и n. Например, среди чисел 8,5 и 11,45 ближайшее к десяти 11,45.
 */

package Lesson_2;

public class Task_2 {
    public static void main(String[] args) {





        System.out.println("test");
    }
}

